===== Example#e7e524

```
user> (set? #{1 2 3})
true

user> (set? (hash-set 1 2 3))
true

user> (set? (sorted-set 1 2 3))
true

user> (set? [1 2 3])
false

user> (set? {:a 1 :b 2})
false
```
